Revit 2026 API

# FabricationConfigurationLoadItemFiles Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FabricationItemFile> LoadItemFiles(
	IList<FabricationItemFile> itemFiles
)
```
```vb
Public Function LoadItemFiles (
	itemFiles As IList(Of FabricationItemFile)
) As IList(Of FabricationItemFile)
```
```cpp
public:
IList<FabricationItemFile^>^ LoadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
```
```fsharp
member LoadItemFiles :
        itemFiles : IList<FabricationItemFile> -> IList<FabricationItemFile>
```

#### Parameters

itemFiles IListFabricationItemFile

#### Return Value

IListFabricationItemFile

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace